train_SM_test_case/generate_data/original_snappy/system/blockMeshDict_block
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 0 0)
    (-1 -1.1 0.05)
    (21 -1.1 0.05)
    (21 1.1 0.05)
    (-1 1.1 0.05)
    (-1 -1.1 -0.05)
    (21 -1.1 -0.05)
    (21 1.1 -0.05)
    (-1 1.1 -0.05)
);

blocks
(
    hex (5 6 7 8 1 2 3 4) (100 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    up
    {
        type empty;
        faces
        (
            (5 6 7 8)
        );
    }

    down
    {
        type empty;
        faces
        (
            (1 2 3 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
