train_SM_test_case/generate_data/original_snappy/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;      // Use hePsiThermo for better compressible treatment
    mixture         pureMixture;
    transport       sutherland;       // Air viscosity changes with temperature
    thermo          hConst;           // Constant Cp
    equationOfState perfectGas;       // Ideal gas law
    specie          specie;
    energy          sensibleEnthalpy;
}

pRef            100000;               // Reference pressure (Pa)

mixture
{
    specie
    {
        molWeight   28.96;             // Molecular weight of air
    }
    thermodynamics
    {
        Cp          1005;              // Specific heat of air (J/kg·K)
        Hf          0;                 // Formation enthalpy
    }
    transport
    {
        As          1.716e-5;          // Sutherland's constant (dynamic viscosity at Ts)
        Ts          273.15;            // Reference temperature for Sutherland (K)
    }
}
