train_SM_test_case/generate_data/original_snappy/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    geometry_inlet
    {
        type            calculated;
        value           $internalField;
    }
    geometry_outlet
    {
        type            calculated;
        value           $internalField;
    }
    geometry_top
    {
        type            calculated;
        value           $internalField;
    }
    geometry_obstacle
    {
        type            calculated;
        value           $internalField;
    }
}
// ************************************************************************* //