train_SM_test_case/generate_data/original_snappy/0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            empty;
    }
    down
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
    geometry_defaultFaces
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    geometry_top
    {
        type            fixedValue;
        value           uniform 2;
    }
    geometry_inlet
    {
        type            fixedValue;
        value           uniform 2;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           uniform 2;
    }
    geometry_obstacle
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
352
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
