train_SM_test_case/generate_data/original_snappy/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            empty;
    }
    down
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
    geometry_defaultFaces
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    geometry_top
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
2232
(
0.00901674
0.00750001
0.00749958
0.00902399
0.00749963
0.00749953
0.00749958
0.0125146
...
)
;
    }
    geometry_inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
186
(
0.00752179
0.00749525
0.00752784
0.00748178
0.0075174
0.00749442
0.00753024
0.00748184
...
)
;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
174
(
0.0150041
0.0150041
0.0150049
0.0150049
0.0150041
0.0150041
0.0150049
0.0150049
...
)
;
    }
    geometry_obstacle
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
352
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
