train_SM_test_case/generate_data/original_snappy/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    up
    {
        type            empty;
    }
    down
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
    geometry_defaultFaces
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    geometry_top
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
2232
(
0.858737
1
0.999944
0.859427
0.999951
0.999937
0.999944
0.834308
...
)
;
    }
    geometry_inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
186
(
1.00291
0.999367
0.860324
0.99757
1.00232
0.999256
0.860599
0.997578
...
)
;
    }
    geometry_outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
174
(
1.00027
1.00027
1.00033
1.00033
1.00027
1.00027
1.00033
1.00032
...
)
;
    }
    geometry_obstacle
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
352
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
